; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_19_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 c18 - counter
	)
  (:init
		(= (value c0) 36)
	(= (value c1) 80)
	(= (value c2) 69)
	(= (value c3) 54)
	(= (value c4) 34)
	(= (value c5) 12)
	(= (value c6) 51)
	(= (value c7) 24)
	(= (value c8) 57)
	(= (value c9) 99)
	(= (value c10) 86)
	(= (value c11) 67)
	(= (value c12) 16)
	(= (value c13) 100)
	(= (value c14) 6)
	(= (value c15) 38)
	(= (value c16) 66)
	(= (value c17) 54)
	(= (value c18) 28)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)
	(= (rate_value c16) 0)
	(= (rate_value c17) 0)
	(= (rate_value c18) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
	(<= (+ (value c15) 1) (value c16))
	(<= (+ (value c16) 1) (value c17))
	(<= (+ (value c17) 1) (value c18))
		)
	)
)

; plan
1. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 7 of 18
2. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 7 of 18
3. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 7 of 18
4. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 7 of 18
5. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 7 of 18
6. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 7 of 18
7. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 7 of 18
8. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 7 of 18
9. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 7 of 18
10. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 7 of 18
11. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 7 of 18
12. (increase_rate c17)
   changed: (rate_value c17) from 0 to 1
   goals met: 7 of 18
13. (increase_rate c17)
   changed: (rate_value c17) from 1 to 2
   goals met: 7 of 18
14. (increase_rate c18)
   changed: (rate_value c18) from 0 to 1
   goals met: 7 of 18
15. (increase_rate c18)
   changed: (rate_value c18) from 1 to 2
   goals met: 7 of 18
16. (increase_rate c18)
   changed: (rate_value c18) from 2 to 3
   goals met: 7 of 18
17. (increase_rate c17)
   changed: (rate_value c17) from 2 to 3
   goals met: 7 of 18
18. (increase_rate c18)
   changed: (rate_value c18) from 3 to 4
   goals met: 7 of 18
19. (increase_rate c17)
   changed: (rate_value c17) from 3 to 4
   goals met: 7 of 18
20. (increment c17)
   changed: (value c17) from 54 to 58
   goals met: 7 of 18
21. (increase_rate c18)
   changed: (rate_value c18) from 4 to 5
   goals met: 7 of 18
22. (increase_rate c17)
   changed: (rate_value c17) from 4 to 5
   goals met: 7 of 18
23. (increment c17)
   changed: (value c17) from 58 to 63
   goals met: 7 of 18
24. (increase_rate c12)
   changed: (rate_value c12) from 6 to 7
   goals met: 7 of 18
25. (increment c12)
   changed: (value c12) from 16 to 23
   goals met: 7 of 18
26. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 7 of 18
27. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 7 of 18
28. (increase_rate c12)
   changed: (rate_value c12) from 7 to 8
   goals met: 7 of 18
29. (increment c12)
   changed: (value c12) from 23 to 31
   goals met: 7 of 18
30. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 7 of 18
31. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 7 of 18
32. (increase_rate c12)
   changed: (rate_value c12) from 8 to 9
   goals met: 7 of 18
33. (increment c12)
   changed: (value c12) from 31 to 40
   goals met: 7 of 18
34. (increase_rate c12)
   changed: (rate_value c12) from 9 to 10
   goals met: 7 of 18
35. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 7 of 18
36. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 7 of 18
37. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 7 of 18
38. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 7 of 18
39. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 7 of 18
40. (increase_rate c11)
   changed: (rate_value c11) from 6 to 7
   goals met: 7 of 18
41. (increase_rate c11)
   changed: (rate_value c11) from 7 to 8
   goals met: 7 of 18
42. (increment c12)
   changed: (value c12) from 40 to 50
   goals met: 7 of 18
43. (increase_rate c11)
   changed: (rate_value c11) from 8 to 9
   goals met: 7 of 18
44. (increase_rate c11)
   changed: (rate_value c11) from 9 to 10
   goals met: 7 of 18
45. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 7 of 18
46. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 7 of 18
47. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 7 of 18
48. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 7 of 18
49. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 7 of 18
50. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 7 of 18
51. (increment c5)
   changed: (value c5) from 12 to 17
   goals met: 7 of 18
52. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 7 of 18
53. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 7 of 18
54. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 7 of 18
55. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 7 of 18
56. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 7 of 18
57. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 7 of 18
58. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 7 of 18
59. (increment c4)
   changed: (value c4) from 34 to 39
   goals met: 7 of 18
60. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 7 of 18
61. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 7 of 18
62. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 7 of 18
63. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 7 of 18
64. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 7 of 18
65. (increment c18)
   changed: (value c18) from 28 to 33
   goals met: 7 of 18
66. (increment c17)
   changed: (value c17) from 63 to 68
   goals met: 8 of 18
67. (increment c12)
   changed: (value c12) from 50 to 60
   goals met: 8 of 18
68. (increment c12)
   changed: (value c12) from 60 to 70
   goals met: 9 of 18
69. (increment c11)
   changed: (value c11) from 67 to 77
   goals met: 8 of 18
70. (increment c12)
   changed: (value c12) from 70 to 80
   goals met: 9 of 18
71. (increment c11)
   changed: (value c11) from 77 to 87
   goals met: 9 of 18
72. (increment c12)
   changed: (value c12) from 80 to 90
   goals met: 10 of 18
73. (increment c10)
   changed: (value c10) from 86 to 90
   goals met: 9 of 18
74. (increment c10)
   changed: (value c10) from 90 to 94
   goals met: 9 of 18
75. (increment c10)
   changed: (value c10) from 94 to 98
   goals met: 9 of 18
76. (decrement c9)
   changed: (value c9) from 99 to 97
   goals met: 10 of 18
77. (increment c5)
   changed: (value c5) from 17 to 23
   goals met: 10 of 18
78. (increment c5)
   changed: (value c5) from 23 to 29
   goals met: 10 of 18
79. (increment c5)
   changed: (value c5) from 29 to 35
   goals met: 10 of 18
80. (increment c5)
   changed: (value c5) from 35 to 41
   goals met: 11 of 18
81. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 11 of 18
82. (increment c4)
   changed: (value c4) from 39 to 45
   goals met: 10 of 18
83. (increment c5)
   changed: (value c5) from 41 to 47
   goals met: 11 of 18
84. (increase_rate c18)
   changed: (rate_value c18) from 5 to 6
   goals met: 11 of 18
85. (increment c18)
   changed: (value c18) from 33 to 39
   goals met: 11 of 18
86. (increment c18)
   changed: (value c18) from 39 to 45
   goals met: 11 of 18
87. (increase_rate c18)
   changed: (rate_value c18) from 6 to 7
   goals met: 11 of 18
88. (increment c18)
   changed: (value c18) from 45 to 52
   goals met: 11 of 18
89. (increment c18)
   changed: (value c18) from 52 to 59
   goals met: 11 of 18
90. (increment c18)
   changed: (value c18) from 59 to 66
   goals met: 11 of 18
91. (increment c18)
   changed: (value c18) from 66 to 73
   goals met: 12 of 18
92. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 12 of 18
93. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 12 of 18
94. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 12 of 18
95. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 12 of 18
96. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 12 of 18
97. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 12 of 18
98. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 12 of 18
99. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 12 of 18
100. (increment c7)
   changed: (value c7) from 24 to 29
   goals met: 12 of 18
101. (increment c7)
   changed: (value c7) from 29 to 34
   goals met: 12 of 18
102. (increment c7)
   changed: (value c7) from 34 to 39
   goals met: 12 of 18
103. (increment c7)
   changed: (value c7) from 39 to 44
   goals met: 12 of 18
104. (increment c7)
   changed: (value c7) from 44 to 49
   goals met: 12 of 18
105. (increment c7)
   changed: (value c7) from 49 to 54
   goals met: 13 of 18
106. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 13 of 18
107. (decrement c1)
   changed: (value c1) from 80 to 77
   goals met: 13 of 18
108. (decrement c1)
   changed: (value c1) from 77 to 74
   goals met: 13 of 18
109. (decrement c1)
   changed: (value c1) from 74 to 71
   goals met: 13 of 18
110. (decrement c1)
   changed: (value c1) from 71 to 68
   goals met: 14 of 18
111. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 14 of 18
112. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 14 of 18
113. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 14 of 18
114. (increase_rate c14)
   changed: (rate_value c14) from 3 to 4
   goals met: 14 of 18
115. (increase_rate c14)
   changed: (rate_value c14) from 4 to 5
   goals met: 14 of 18
116. (increase_rate c14)
   changed: (rate_value c14) from 5 to 6
   goals met: 14 of 18
117. (increase_rate c14)
   changed: (rate_value c14) from 6 to 7
   goals met: 14 of 18
118. (increase_rate c14)
   changed: (rate_value c14) from 7 to 8
   goals met: 14 of 18
119. (increment c14)
   changed: (value c14) from 6 to 14
   goals met: 14 of 18
120. (increase_rate c14)
   changed: (rate_value c14) from 8 to 9
   goals met: 14 of 18
121. (increment c14)
   changed: (value c14) from 14 to 23
   goals met: 14 of 18
122. (increment c14)
   changed: (value c14) from 23 to 32
   goals met: 14 of 18
123. (increment c14)
   changed: (value c14) from 32 to 41
   goals met: 13 of 18
124. (increment c14)
   changed: (value c14) from 41 to 50
   goals met: 13 of 18
125. (increment c14)
   changed: (value c14) from 50 to 59
   goals met: 13 of 18
126. (increment c14)
   changed: (value c14) from 59 to 68
   goals met: 13 of 18
127. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 13 of 18
128. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 13 of 18
129. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 13 of 18
130. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 13 of 18
131. (increase_rate c15)
   changed: (rate_value c15) from 2 to 3
   goals met: 13 of 18
132. (increment c14)
   changed: (value c14) from 68 to 77
   goals met: 13 of 18
133. (increase_rate c15)
   changed: (rate_value c15) from 3 to 4
   goals met: 13 of 18
134. (increase_rate c15)
   changed: (rate_value c15) from 4 to 5
   goals met: 13 of 18
135. (increment c15)
   changed: (value c15) from 38 to 43
   goals met: 13 of 18
136. (increment c15)
   changed: (value c15) from 43 to 48
   goals met: 13 of 18
137. (increase_rate c14)
   changed: (rate_value c14) from 9 to 10
   goals met: 13 of 18
138. (increment c15)
   changed: (value c15) from 48 to 53
   goals met: 13 of 18
139. (increment c15)
   changed: (value c15) from 53 to 58
   goals met: 13 of 18
140. (increment c15)
   changed: (value c15) from 58 to 63
   goals met: 13 of 18
141. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 13 of 18
142. (decrement c2)
   changed: (value c2) from 69 to 66
   goals met: 12 of 18
143. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 12 of 18
144. (decrement c2)
   changed: (value c2) from 66 to 62
   goals met: 12 of 18
145. (decrement c1)
   changed: (value c1) from 68 to 65
   goals met: 12 of 18
146. (decrement c1)
   changed: (value c1) from 65 to 62
   goals met: 12 of 18
147. (decrement c1)
   changed: (value c1) from 62 to 59
   goals met: 13 of 18
148. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 13 of 18
149. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 13 of 18
150. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 13 of 18
151. (decrement c13)
   changed: (value c13) from 100 to 95
   goals met: 13 of 18
152. (decrement c13)
   changed: (value c13) from 95 to 90
   goals met: 12 of 18
153. (increment c11)
   changed: (value c11) from 87 to 97
   goals met: 11 of 18
154. (increment c12)
   changed: (value c12) from 90 to 100
   goals met: 12 of 18
155. (decrement c10)
   changed: (value c10) from 98 to 94
   goals met: 12 of 18
156. (decrement c9)
   changed: (value c9) from 97 to 95
   goals met: 12 of 18
157. (decrement c9)
   changed: (value c9) from 95 to 93
   goals met: 13 of 18
158. (increment c13)
   changed: (value c13) from 90 to 95
   goals met: 13 of 18
159. (increase_rate c13)
   changed: (rate_value c13) from 5 to 6
   goals met: 13 of 18
160. (increase_rate c13)
   changed: (rate_value c13) from 6 to 7
   goals met: 13 of 18
161. (increase_rate c13)
   changed: (rate_value c13) from 7 to 8
   goals met: 13 of 18
162. (increase_rate c13)
   changed: (rate_value c13) from 8 to 9
   goals met: 13 of 18
163. (increment c4)
   changed: (value c4) from 45 to 51
   goals met: 12 of 18
164. (increment c5)
   changed: (value c5) from 47 to 53
   goals met: 12 of 18
165. (increment c6)
   changed: (value c6) from 51 to 54
   goals met: 12 of 18
166. (increment c7)
   changed: (value c7) from 54 to 59
   goals met: 12 of 18
167. (increment c3)
   changed: (value c3) from 54 to 59
   goals met: 12 of 18
168. (decrement c2)
   changed: (value c2) from 62 to 58
   goals met: 12 of 18
169. (decrement c1)
   changed: (value c1) from 59 to 56
   goals met: 13 of 18
170. (decrement c12)
   changed: (value c12) from 100 to 90
   goals met: 13 of 18
171. (decrement c11)
   changed: (value c11) from 97 to 87
   goals met: 13 of 18
172. (decrement c10)
   changed: (value c10) from 94 to 90
   goals met: 12 of 18
173. (decrement c10)
   changed: (value c10) from 90 to 86
   goals met: 13 of 18
174. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 13 of 18
175. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 13 of 18
176. (decrement c9)
   changed: (value c9) from 93 to 89
   goals met: 13 of 18
177. (decrement c9)
   changed: (value c9) from 89 to 85
   goals met: 14 of 18
178. (decrement c7)
   changed: (value c7) from 59 to 54
   goals met: 14 of 18
179. (decrement c6)
   changed: (value c6) from 54 to 51
   goals met: 14 of 18
180. (decrement c5)
   changed: (value c5) from 53 to 47
   goals met: 14 of 18
181. (decrement c4)
   changed: (value c4) from 51 to 45
   goals met: 15 of 18
182. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 15 of 18
183. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 15 of 18
184. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 15 of 18
185. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 15 of 18
186. (increment c15)
   changed: (value c15) from 63 to 68
   goals met: 14 of 18
187. (decrement c14)
   changed: (value c14) from 77 to 67
   goals met: 15 of 18
188. (increase_rate c13)
   changed: (rate_value c13) from 9 to 10
   goals met: 15 of 18
189. (decrement c13)
   changed: (value c13) from 95 to 85
   goals met: 14 of 18
190. (decrement c12)
   changed: (value c12) from 90 to 80
   goals met: 14 of 18
191. (decrement c11)
   changed: (value c11) from 87 to 77
   goals met: 14 of 18
192. (decrement c10)
   changed: (value c10) from 86 to 82
   goals met: 13 of 18
193. (decrement c10)
   changed: (value c10) from 82 to 78
   goals met: 13 of 18
194. (decrement c10)
   changed: (value c10) from 78 to 74
   goals met: 14 of 18
195. (decrement c9)
   changed: (value c9) from 85 to 81
   goals met: 14 of 18
196. (decrement c9)
   changed: (value c9) from 81 to 77
   goals met: 14 of 18
197. (decrement c9)
   changed: (value c9) from 77 to 73
   goals met: 15 of 18
198. (increment c14)
   changed: (value c14) from 67 to 77
   goals met: 14 of 18
199. (decrement c15)
   changed: (value c15) from 68 to 63
   goals met: 15 of 18
200. (decrement c13)
   changed: (value c13) from 85 to 75
   goals met: 15 of 18
201. (decrement c12)
   changed: (value c12) from 80 to 70
   goals met: 15 of 18
202. (decrement c11)
   changed: (value c11) from 77 to 67
   goals met: 15 of 18
203. (decrement c10)
   changed: (value c10) from 74 to 70
   goals met: 14 of 18
204. (decrement c10)
   changed: (value c10) from 70 to 66
   goals met: 15 of 18
205. (decrement c9)
   changed: (value c9) from 73 to 69
   goals met: 15 of 18
206. (decrement c9)
   changed: (value c9) from 69 to 65
   goals met: 16 of 18
207. (decrement c3)
   changed: (value c3) from 59 to 54
   goals met: 15 of 18
208. (decrement c3)
   changed: (value c3) from 54 to 49
   goals met: 15 of 18
209. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 15 of 18
210. (decrement c3)
   changed: (value c3) from 49 to 44
   goals met: 16 of 18
211. (decrement c2)
   changed: (value c2) from 58 to 53
   goals met: 15 of 18
212. (decrement c2)
   changed: (value c2) from 53 to 48
   goals met: 15 of 18
213. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 15 of 18
214. (decrement c2)
   changed: (value c2) from 48 to 43
   goals met: 16 of 18
215. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 16 of 18
216. (decrement c1)
   changed: (value c1) from 56 to 51
   goals met: 16 of 18
217. (decrement c1)
   changed: (value c1) from 51 to 46
   goals met: 16 of 18
218. (decrement c1)
   changed: (value c1) from 46 to 41
   goals met: 17 of 18
219. (increment c15)
   changed: (value c15) from 63 to 68
   goals met: 16 of 18
220. (increment c15)
   changed: (value c15) from 68 to 73
   goals met: 16 of 18
221. (increase_rate c16)
   changed: (rate_value c16) from 0 to 1
   goals met: 16 of 18
222. (increase_rate c16)
   changed: (rate_value c16) from 1 to 2
   goals met: 16 of 18
223. (increase_rate c16)
   changed: (rate_value c16) from 2 to 3
   goals met: 16 of 18
224. (increment c16)
   changed: (value c16) from 66 to 69
   goals met: 15 of 18
225. (increment c17)
   changed: (value c17) from 68 to 73
   goals met: 15 of 18
226. (increment c18)
   changed: (value c18) from 73 to 80
   goals met: 16 of 18
227. (increment c16)
   changed: (value c16) from 69 to 72
   goals met: 16 of 18
228. (increment c16)
   changed: (value c16) from 72 to 75
   goals met: 16 of 18
229. (increment c17)
   changed: (value c17) from 73 to 78
   goals met: 17 of 18
230. (increment c15)
   changed: (value c15) from 73 to 78
   goals met: 17 of 18
231. (increment c16)
   changed: (value c16) from 75 to 78
   goals met: 16 of 18
232. (increment c17)
   changed: (value c17) from 78 to 83
   goals met: 16 of 18
233. (increment c18)
   changed: (value c18) from 80 to 87
   goals met: 17 of 18
234. (increment c16)
   changed: (value c16) from 78 to 81
   goals met: 18 of 18
